pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_loader/cy_loader_smif.c
/*******************************************************************************
 * \file cy_loader_smif.c
 * \version 1.0
 *
 * \brief
 *  Implements SMIF Loader APIs.
 *
 ********************************************************************************
 * \copyright
 * Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
 * You may use this file only in accordance with the license, terms, conditions,
 * disclaimers, and limitations in the end user license agreement accompanying
 * the software package with which this file was provided.
 *******************************************************************************/

#include "cy_loader_smif.h"

#if defined(BUILD_ENABLE_LOADER_SMIF)

SMIF_Type *SMIF_Block = (SMIF_Type *)SMIF0_BASE;      /* SMIF Block address                      */
cy_stc_smif_config_t *InitializedSMIFConfig = NULL;   /* Last time initialized SMIF block config */
cy_stc_smif_block_config_t *SMIF_Block_Config = NULL; /* SMIF block config structure */
cy_stc_smif_context_t SMIF_Context = {
	.txBufferAddress = NULL,
	.txBufferSize = 1,
	.txBufferCounter = 0,
	.rxBufferAddress = NULL,
	.rxBufferSize = 1,
	.rxBufferCounter = 0,
	.transferStatus = 0,
	.txCmpltCb = NULL,
	.rxCmpltCb = NULL,
	.timeout = 0,
};                               /* Allocate the SMIF transfer parameters.  */
bool isSMIFStructLoaded = false; /* Is SMIF structures loaded               */

cy_stc_smif_config_t SMIF_Config_NORMAL = /* SMIF configuration parameters */
	{
		.mode = CY_SMIF_NORMAL,               /* Normal (Erase/Program) Mode of operation */
		.deselectDelay = SMIF_DESELECT_DELAY, /* Minimum duration of SPI deselection */
		.rxClockSel = SMIF_RX_CLOCK_SELECT,   /* Clock source for the receiver clock */
		.blockEvent = SMIF_AHB_BUS_ERROR,     /* What happens when there is a read
											   * from an empty RX FIFO or write to a full TX FIFO */
};

cy_stc_smif_config_t SMIF_Config_MEMORY = /* SMIF configuration parameters */
	{
		.mode = CY_SMIF_MEMORY,               /* Memory (XIP) mode of operation */
		.deselectDelay = SMIF_DESELECT_DELAY, /* Minimum duration of SPI deselection */
		.rxClockSel = SMIF_RX_CLOCK_SELECT,   /* Clock source for the receiver clock */
		.blockEvent = SMIF_AHB_BUS_ERROR,     /* What happens when there is a read
											   * from an empty RX FIFO or write to a full TX FIFO */
};

/*******************************************************************************
 * Function Name: ExtMemInterrupt
 ********************************************************************************
 *
 * The ISR for the SMIF interrupt. All Read/Write transfers to/from the external
 * memory are processed inside the SMIF ISR.
 *
 *******************************************************************************/
void ExtMemInterrupt(void) { Cy_SMIF_Interrupt(SMIF_Block, &SMIF_Context); }

/*******************************************************************************
 * Function Name: Loader_SMIF_LoadStructFromFlash
 ********************************************************************************
 *
 * Loads SMIF configuration structures from internal Flash memory
 *
 * \param forceUpdate
 * Force update the structures even if they have been loaded in past
 *
 * \return
 * Status
 * - RESULT_OK: Loaded successfully
 * - RESULT_ERROR: Loading failed
 *
 *******************************************************************************/
result_t Loader_SMIF_LoadStructFromFlash(bool forceUpdate) {
	uint32_t result = RESULT_ERROR;
	uint32_t *smifPointerInTocAddr = NULL;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_LoadStructFromFlash";
	LOG_FUNC_START(logFuncName);
	LOG(" | Force update           : 0x%02X\r\n", (unsigned int)forceUpdate);
#endif

	/* Do not load structures again if already loaded */
	if (isSMIFStructLoaded && !forceUpdate) {
#ifdef DEBUG_LOG
		LOG("   Skipped: already loaded\r\n");
		LOG_FUNC_END(logFuncName, RESULT_ERROR_OK);
#endif

		result = RESULT_ERROR_OK;
	}

	if (result != RESULT_ERROR_OK) {
		isSMIFStructLoaded = false;

		smifPointerInTocAddr = (uint32_t *)(TARGET_TOC_ADDR + SMIF_CONF_TABLE_OFFS_IN_TOC);
		smifPointerInTocAddr = (uint32_t *)*smifPointerInTocAddr;

#ifdef DEBUG_LOG
		LOG(" | TOC address            : 0x%08X\r\n", (unsigned int)TARGET_TOC_ADDR);
		LOG(" | SMIF offset in TOC     : 0x%08X\r\n", (unsigned int)SMIF_CONF_TABLE_OFFS_IN_TOC);
		LOG(" | SMIF config address    : 0x%08X\r\n", (unsigned int)*smifPointerInTocAddr);
#endif

		result = RESULT_OK;

		/* Check whether SMIF pointer in TOC has valid address*/
		if ((*smifPointerInTocAddr == 0x00000000) || (*smifPointerInTocAddr == 0xFFFFFFFF) ||
			(*smifPointerInTocAddr < TARGET_FLASH_ADDR)) {
#ifdef DEBUG_LOG
			LOG("   E! TOC contains invalid pointer to SMIF configuration structure.\r\n");
			LOG_FUNC_END(logFuncName, RESULT_ERROR);
#endif

			result = RESULT_ERROR;
		}
	}

	if ((result != RESULT_ERROR) && (result != RESULT_ERROR_OK)) {
		SMIF_Block_Config = (cy_stc_smif_block_config_t *)(*smifPointerInTocAddr);
		isSMIFStructLoaded = true;

#ifdef DEBUG_LOG
		LOG(" | SMIF config values       ->\r\n");
		LOG("   | Driver version       : 0x%04X.0x%04X\r\n", SMIF_Block_Config->majorVersion,
			SMIF_Block_Config->minorVersion);
		LOG("   | Mem. configs count   : 0x%08X\r\n", (unsigned int)SMIF_Block_Config->memCount);
		LOG("   | Mem. configs array   : [0x%08X]\r\n", (unsigned int)*SMIF_Block_Config->memConfig);
		for (uint16_t i = 0; i < SMIF_Block_Config->memCount; i++) {
			LOG("   | MemConfig[0x%04X]      ->\r\n", i);
			cy_stc_smif_mem_config_t *memConfig = SMIF_Block_Config->memConfig[i];
			LOG("   | baseAddress          : 0x%08X\r\n", (unsigned int)memConfig->baseAddress);
			LOG("   | memMappedSize        : 0x%08X\r\n", (unsigned int)memConfig->memMappedSize);
			LOG("   | slaveSelect          : 0x%08X\r\n", (unsigned int)memConfig->slaveSelect);
			LOG("   | flags                : 0x%08X\r\n", (unsigned int)memConfig->flags);
			LOG("   | dataSelect           : 0x%08X\r\n", (unsigned int)memConfig->dataSelect);
			LOG("   | dualQuadEnable       : 0x%08X\r\n", (unsigned int)memConfig->dualQuadSlots);
			LOG("   | deviceCfg [0x%08X] ->\r\n", (unsigned int)memConfig->deviceCfg);
			cy_stc_smif_mem_device_cfg_t *deviceCfg = memConfig->deviceCfg;
			LOG("     | memSize            : 0x%08X\r\n", (unsigned int)deviceCfg->memSize);
			LOG("     | eraseSize          : 0x%08X\r\n", (unsigned int)deviceCfg->eraseSize);
			LOG("     | programSize        : 0x%08X\r\n", (unsigned int)deviceCfg->programSize);
			LOG("     | numOfAddrBytes     : 0x%08X\r\n", (unsigned int)deviceCfg->numOfAddrBytes);
		}
		LOG_FUNC_END(logFuncName, RESULT_OK);
		result = RESULT_OK;
#endif
	}

