pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_loader/cy_loader_smif.c
	if (result == RESULT_ERROR_OK) {
		result = RESULT_OK;
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_FindMemDeviceByAddr
 ********************************************************************************
 *
 * Search for memory configuration structures by provided XIP mapped address.
 * Pointer smifMemDeviceConfig contains device config if the address was
 * found.
 *
 * \param addr
 * Address inside XIP address space, where memory is mapped
 *
 * \param smifMemConfig
 * SMIF memory device (Slot) configuration structure
 *
 * \param smifMemDeviceConfig
 * Pointer to memory device configuration structure to be set, if address was
 * found.
 *
 * \return
 * Status
 * - RESULT_OK: Found
 * - RESULT_ERROR: Not found
 *
 *******************************************************************************/
result_t Loader_SMIF_FindMemDeviceByAddr(uint32_t addr, cy_stc_smif_mem_config_t **smifMemConfig,
										 cy_stc_smif_mem_device_cfg_t **smifMemDeviceConfig) {
	bool foundMemDevice = false;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_FindMemDeviceByAddr";
	LOG_FUNC_START(logFuncName);
	LOG(" | addr                   : 0x%02X\r\n", (unsigned int)addr);
#endif

	/* Load SMIF configuration structures if not yet loaded*/
	uint32_t result = Loader_SMIF_LoadStructFromFlash(false);

	if (result != RESULT_OK) {
#ifdef DEBUG_LOG
		LOG_FUNC_END(logFuncName, result);
#endif

		result = RESULT_ERROR;
	}

	if (result != RESULT_ERROR) {
		/* Find SMIF memory configuration structure by XIP address */
		result = RESULT_ERROR;
		uint16_t memCount = SMIF_Block_Config->memCount;
		for (int memIdx = 0; memIdx < memCount; memIdx++) {
			if (SMIF_Block_Config->memConfig[memIdx] != NULL) {
				*smifMemConfig = SMIF_Block_Config->memConfig[memIdx];
				if ((((*smifMemConfig)->flags) & CY_SMIF_FLAG_MEMORY_MAPPED) != 0) {
					if ((addr >= (*smifMemConfig)->baseAddress) &&
						(addr < ((*smifMemConfig)->baseAddress + (*smifMemConfig)->memMappedSize))) {
						*smifMemDeviceConfig = (*smifMemConfig)->deviceCfg;
						foundMemDevice = true;
						break;
					}
				}
			}
		}
	}

	result = foundMemDevice ? RESULT_OK : RESULT_ERROR;

	LOG_FUNC_END(logFuncName, result);

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_Init
 ********************************************************************************
 *
 * Initialize SMIF block
 *
 * \param smifConfig
 * SMIF configuration
 *
 * \param forceInit
 * Force re-initialization even if was initialized before
 *
 * \return
 * Status
 * - RESULT_OK: Initialized successfully
 * - RESULT_ERROR: Not initialized
 *
 *******************************************************************************/
result_t Loader_SMIF_Init(cy_stc_smif_config_t smifConfig, bool forceInit) {
#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Init";
	LOG_FUNC_START(logFuncName);
	LOG(" | forceInit              : 0x%08X\r\n", (unsigned int)forceInit);
	LOG(" | SMIF config              ->\r\n");
	LOG("   | mode                 : 0x%08X\r\n", (unsigned int)smifConfig.mode);
	LOG("   | blockEvent           : 0x%08X\r\n", (unsigned int)smifConfig.blockEvent);
	LOG("   | deselectDelay        : 0x%08X\r\n", (unsigned int)smifConfig.deselectDelay);
	LOG("   | rxClockSel           : 0x%08X\r\n", (unsigned int)smifConfig.rxClockSel);
#endif

	result_t result = RESULT_OK;
	result_smif_t smifResult = CY_SMIF_SUCCESS;
	/* Do not re-initialize SMIF block if it is already initialized with the same config */
	if ((!forceInit) && (NULL != InitializedSMIFConfig) && (InitializedSMIFConfig == &smifConfig)) {
#ifdef DEBUG_LOG
		LOG("   Skipped: already initialized\r\n");
		LOG_FUNC_END(logFuncName, result);
#endif

		result = RESULT_ERROR_OK;
	}

	if ((result != RESULT_ERROR) && (result != RESULT_ERROR_OK)) {
		InitializedSMIFConfig = NULL;

		/* Load SMIF configuration structures if not yet loaded */
		result = Loader_SMIF_LoadStructFromFlash(forceInit);
	}

	if ((result != RESULT_ERROR) && (result != RESULT_ERROR_OK)) {
		/* Initialize SMIF communication block */
		smifResult = Cy_SMIF_Init(SMIF_Block, &smifConfig, SMIF_DRIVER_TIMEOUT, &SMIF_Context);
	}

	if ((smifResult == CY_SMIF_SUCCESS) && ((result != RESULT_ERROR) && (result != RESULT_ERROR_OK))) {
		smifResult = Cy_SMIF_Memslot_Init(SMIF_Block, SMIF_Block_Config, &SMIF_Context);
	} else {
		if (result != RESULT_ERROR_OK) {
			result = RESULT_ERROR;
		}
	}

	if ((smifResult == CY_SMIF_SUCCESS) && ((result != RESULT_ERROR) && (result != RESULT_ERROR_OK))) {
		Cy_SMIF_Enable(SMIF_Block, &SMIF_Context);

		uint16_t memCount = SMIF_Block_Config->memCount;
		for (int memIdx = 0; memIdx < memCount; memIdx++) {
			if (SMIF_Block_Config->memConfig[memIdx] != NULL) {
				if (SMIF_Block_Config->memConfig[memIdx]->deviceCfg->stsRegQuadEnableMask != 0) {
					smifResult =
						Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Block, SMIF_Block_Config->memConfig[memIdx], &SMIF_Context);
					if (smifResult == CY_SMIF_SUCCESS) {
						Cy_SMIF_Memslot_QuadEnable(SMIF_Block, SMIF_Block_Config->memConfig[memIdx], &SMIF_Context);
					}
				}
			}
		}

		InitializedSMIFConfig = &smifConfig;

		LOG_FUNC_END(logFuncName, RESULT_OK);
		result = RESULT_OK;
	}

	if (result == RESULT_ERROR_OK) {
		result = RESULT_OK;
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_WaitForDevice
 ********************************************************************************
 *
 * Checks the status of the transfer.
 *
 * \param smifMemConfig
 * SMIF memory device configuration structure
 *
 * \param timeoutAttempts
 * Timeout
 *
 * \return
 * Status
 * - RESULT_OK: Device is not busy
 * - RESULT_ERROR: Device is busy
 *
 *******************************************************************************/
result_t Loader_SMIF_WaitForDevice(cy_stc_smif_mem_config_t *smifMemConfig, int timeoutAttempts) {
	bool isBusy;
	int attemptsElapsed = 0;
	cy_stc_smif_mem_config_t *smifMemConfigSecondDev = NULL;
	uint32_t result = RESULT_OK;

	/* Wait while data is transmitted */
	do {
		isBusy = Cy_SMIF_Memslot_IsBusy(SMIF_Block, smifMemConfig, &SMIF_Context);
		if (((*smifMemConfig).dualQuadSlots != 0) && (!isBusy)) {
			Loader_SMIF_FindSecondDevice(&smifMemConfigSecondDev, (*smifMemConfig).dualQuadSlots);
			isBusy = Cy_SMIF_Memslot_IsBusy(SMIF_Block, smifMemConfigSecondDev, &SMIF_Context);
		}
		if (isBusy) {
			/* Check for timeoutAttempts */
			if (attemptsElapsed > timeoutAttempts) {
				result = RESULT_ERROR;

				break;
			}

			Cy_SysLib_DelayUs(SMIF_POLLING_DELAY);
			attemptsElapsed++;
		}
	} while (isBusy);

	return (result);
}

