pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_loader/cy_loader_smif.c
/*******************************************************************************
 * Function Name: Loader_SMIF_Erase
 ********************************************************************************
 *
 * Erases block of SMIF memory
 *
 * \param blockAddr
 * Absolute address in target block
 *
 * \blockSize
 * Size of block to be erased
 *
 * \return
 * Status
 * - RESULT_OK: Erased successfully
 * - RESULT_ERROR: Erasing failed
 *
 *******************************************************************************/
result_t Loader_SMIF_Erase(uint32_t blockAddr, uint32_t blockSize) {
	result_t result = RESULT_OK;
	result_smif_t smifResult;
	uint8_t status = 0;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Erase";
	LOG_FUNC_START(logFuncName);
	LOG(" | blockAddr              : 0x%08X\r\n", (unsigned int)blockAddr);
	LOG(" | blockSize              : 0x%08X\r\n", (unsigned int)blockSize);
#endif

	/* Find SMIF memory configuration structures by address */
	uint32_t xipAddr = blockAddr;
	uint32_t isDualMember = 0;
	cy_stc_smif_mem_config_t *smifMemConfig = NULL;
	cy_stc_smif_mem_config_t *smifMemConfigSecondDev = NULL;
	cy_stc_smif_mem_device_cfg_t *smifMemDeviceConfig = NULL;
	result = Loader_SMIF_FindMemDeviceByAddr(xipAddr, &smifMemConfig, &smifMemDeviceConfig);

	if (result == RESULT_OK) {
		/* Save Dual quad second member */
		if (smifMemConfig->dualQuadSlots != 0) {
			isDualMember = smifMemConfig->dualQuadSlots;
			result = Loader_SMIF_FindSecondDevice(&smifMemConfigSecondDev, smifMemConfig->dualQuadSlots);
		}
	}

	if (result == RESULT_OK) {
		/* Initialize SMIF block if not initialized yet */
		result = Loader_SMIF_Init(SMIF_Config_NORMAL, false);
	}

	/* Determine size for portions of data*/
	uint32_t remainedSize = blockSize;
	uint32_t segmentSize = smifMemDeviceConfig->eraseSize;

	/* Determine addresses for input buffer and for target memory */
	uint32_t startAddr = blockAddr - smifMemConfig->baseAddress;
	uint32_t currentAddr = startAddr;

	if (result == RESULT_OK) {
		/* Wait while memory device is busy */
		result = Loader_SMIF_WaitForDevice(smifMemConfig, SMIF_ERASE_TIMEOUT);
	}

	if (result == RESULT_OK) {
		/* Erase data by segments */
		while (remainedSize > 0u) {
			uint8_t addressInFlash[4] = {0, 0, 0, 0};
			if (smifMemConfig->deviceCfg->numOfAddrBytes == 1) {
				addressInFlash[0] = (currentAddr)&0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 2) {
				addressInFlash[1] = (currentAddr)&0xFF;
				addressInFlash[0] = (currentAddr >> 8) & 0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 3) {
				addressInFlash[2] = (currentAddr)&0xFF;
				addressInFlash[1] = (currentAddr >> 8) & 0xFF;
				addressInFlash[0] = (currentAddr >> 16) & 0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 4) {
				addressInFlash[3] = (currentAddr)&0xFF;
				addressInFlash[2] = (currentAddr >> 8) & 0xFF;
				addressInFlash[1] = (currentAddr >> 16) & 0xFF;
				addressInFlash[0] = (currentAddr >> 24) & 0xFF;
			}

#if defined(BUILD_ENABLE_LEDS)
			/* Blink LED to catch the period of each loop*/
			Cy_GPIO_Inv(LED_Status0_0);
#endif

#ifdef DEBUG_LOG
			LOG("   | erasing sector: [currentAddr=0x%08X, segmentSize=0x%08X]\r\n", (unsigned int)currentAddr,
				(unsigned int)segmentSize);
#endif

			/* Enable memory write */
			smifResult = Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Block, smifMemConfig, &SMIF_Context);
			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			if (isDualMember != 0) {
				/* Enable memory write */
				smifResult = Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Block, smifMemConfigSecondDev, &SMIF_Context);
				if (smifResult != CY_SMIF_SUCCESS) {
					result = RESULT_ERROR;
					break;
				}
			}

			/* Erase current segment */
			if (remainedSize < segmentSize) {
				segmentSize = remainedSize;
			}

			smifResult = Cy_SMIF_Memslot_CmdSectorErase(SMIF_Block, smifMemConfig, addressInFlash, &SMIF_Context);
			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			if (isDualMember != 0) {
				smifResult =
					Cy_SMIF_Memslot_CmdSectorErase(SMIF_Block, smifMemConfigSecondDev, addressInFlash, &SMIF_Context);

				if (smifResult != CY_SMIF_SUCCESS) {
					result = RESULT_ERROR;
					break;
				}
			}

			/* Wait while memory device is busy */
			do {
				while (Cy_SMIF_BusyCheck(SMIF_Block)) {
				}
				smifResult =
					Cy_SMIF_TransmitCommand(SMIF_Block, smifMemConfig->deviceCfg->readStsRegWipCmd->command,
											CY_SMIF_WIDTH_SINGLE, CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_CMD_WITHOUT_PARAM,
											(cy_en_smif_txfr_width_t)CY_SMIF_CMD_WITHOUT_PARAM,
											smifMemConfig->slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE, &SMIF_Context);

				/* Enter the receiving mode */
				SMIF_Block->TX_CMD_FIFO_WR =
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_RX_COUNT_MODE) |
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)CY_SMIF_WIDTH_SINGLE) |
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_RX_COUNT, ((uint32_t)(CY_SMIF_READ_ONE_BYTE - 1U)));

				while (SMIF_Block->RX_DATA_FIFO_STATUS == 0) {
				}
				status = SMIF_Block->RX_DATA_FIFO_RD1;
				Cy_SysLib_DelayUs(SMIF_POLLING_DELAY);
			} while ((status & smifMemConfig->deviceCfg->stsRegBusyMask) != 0);

			if (isDualMember != 0) {
				/* Wait while memory device is busy */
				do {
					while (Cy_SMIF_BusyCheck(SMIF_Block)) {
					}
					smifResult = Cy_SMIF_TransmitCommand(
						SMIF_Block, smifMemConfigSecondDev->deviceCfg->readStsRegWipCmd->command, CY_SMIF_WIDTH_SINGLE,
						CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_CMD_WITHOUT_PARAM,
						(cy_en_smif_txfr_width_t)CY_SMIF_CMD_WITHOUT_PARAM, smifMemConfigSecondDev->slaveSelect,
						CY_SMIF_TX_NOT_LAST_BYTE, &SMIF_Context);

					/* Enter the receiving mode */
					SMIF_Block->TX_CMD_FIFO_WR =
						_VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_RX_COUNT_MODE) |
						_VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)CY_SMIF_WIDTH_SINGLE) |
						_VAL2FLD(CY_SMIF_CMD_FIFO_WR_RX_COUNT, ((uint32_t)(CY_SMIF_READ_ONE_BYTE - 1U)));

					while (SMIF_Block->RX_DATA_FIFO_STATUS == 0) {
					}
					status = SMIF_Block->RX_DATA_FIFO_RD1;
					Cy_SysLib_DelayUs(SMIF_POLLING_DELAY);
				} while ((status & smifMemConfigSecondDev->deviceCfg->stsRegBusyMask) != 0);
			}

			result = Loader_SMIF_WaitForDevice(smifMemConfig, SMIF_ERASE_TIMEOUT);
			if (result != RESULT_OK) {
				break;
			}

			remainedSize -= segmentSize;
			currentAddr += segmentSize;
		}
	}

