pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_loader/cy_loader_smif.c
#ifdef DEBUG_LOG
	LOG_FUNC_END(logFuncName, result);
#endif

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_Program
 ********************************************************************************
 *
 * Program page in XIP mapped memory
 *
 * \param blockAddr
 * Block start address
 *
 * \param offsetInBlock
 * Offset in given block
 *
 * \param buffer
 * Data to be programmed
 *
 * \param size
 * Size of data to be programmed
 *
 * \return
 * Status
 * - RESULT_OK: Programmed successfully
 * - RESULT_ERROR: Programming failed
 *
 *******************************************************************************/
result_t Loader_SMIF_Program(uint32_t blockAddr, uint32_t offsetInBlock, uint8_t *buffer, uint32_t size) {
	result_t result = RESULT_OK;
	result_smif_t smifResult;
	uint8_t status = 0;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Program";
	LOG_FUNC_START(logFuncName);
	LOG(" | blockAddr              : 0x%08X\r\n", (unsigned int)blockAddr);
	LOG(" | offsetInBlock          : 0x%08X\r\n", (unsigned int)offsetInBlock);
	LOG(" | buffer                 : 0x%08X\r\n", (unsigned int)buffer);
	LOG(" | size                   : 0x%08X\r\n", (unsigned int)size);
#endif

	/* Find SMIF memory configuration structures by address */
	uint32_t xipAddr = blockAddr + offsetInBlock;
	cy_stc_smif_mem_config_t *smifMemConfig = NULL;
	uint32_t isDualMember = 0;
	cy_stc_smif_mem_config_t *smifMemConfigSecondDev = NULL;
	cy_stc_smif_mem_device_cfg_t *smifMemDeviceConfig = NULL;
	result = Loader_SMIF_FindMemDeviceByAddr(xipAddr, &smifMemConfig, &smifMemDeviceConfig);
	if (result == RESULT_OK) {
		/* Save Dual quad second member */
		if (smifMemConfig->dualQuadSlots != 0) {
			isDualMember = smifMemConfig->dualQuadSlots;
			result = Loader_SMIF_FindSecondDevice(&smifMemConfigSecondDev, smifMemConfig->dualQuadSlots);
		}
	}
	if (result != RESULT_ERROR) {
		/* Initialize SMIF block if not initialized yet */
		result = Loader_SMIF_Init(SMIF_Config_NORMAL, true);
	}

	/* Determine size for portions of data*/
	uint32_t remainedSize = size;
	uint32_t segmentSize = smifMemDeviceConfig->programSize;

	/* Determine addresses for input buffer and for target memory */
	uint32_t startAddr = blockAddr - smifMemConfig->baseAddress + offsetInBlock;
	uint32_t currentAddr = startAddr;
	uint32_t offsetInBuffer = 0;

	if (result != RESULT_ERROR) {
		/* Wait while memory device is busy */
		result = Loader_SMIF_WaitForDevice(smifMemConfig, SMIF_PROGRAM_TIMEOUT);
	}

	if (result != RESULT_ERROR) {
		/* Write data by segments */
		while (remainedSize > 0) {
			uint8_t addressInFlash[4] = {0, 0, 0, 0};
			if (smifMemConfig->deviceCfg->numOfAddrBytes == 1) {
				addressInFlash[0] = (currentAddr)&0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 2) {
				addressInFlash[1] = (currentAddr)&0xFF;
				addressInFlash[0] = (currentAddr >> 8) & 0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 3) {
				addressInFlash[2] = (currentAddr)&0xFF;
				addressInFlash[1] = (currentAddr >> 8) & 0xFF;
				addressInFlash[0] = (currentAddr >> 16) & 0xFF;
			} else if (smifMemConfig->deviceCfg->numOfAddrBytes == 4) {
				addressInFlash[3] = (currentAddr)&0xFF;
				addressInFlash[2] = (currentAddr >> 8) & 0xFF;
				addressInFlash[1] = (currentAddr >> 16) & 0xFF;
				addressInFlash[0] = (currentAddr >> 24) & 0xFF;
			}

#if defined(BUILD_ENABLE_LEDS)
			/* Blink LED to catch the period of each loop*/
			Cy_GPIO_Inv(LED_Status0_0);
#endif

#ifdef DEBUG_LOG
			LOG("   | programming sector: [offsetInBlock=0x%08X, segmentSize=0x%08X, offsetInBuffer=0x%08X]\r\n",
				(unsigned int)offsetInBlock, (unsigned int)segmentSize, (unsigned int)offsetInBuffer);
#endif

			/* Enable memory write */
			smifResult = Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Block, smifMemConfig, &SMIF_Context);
			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			if (isDualMember != 0) {
				/* Enable memory write */
				smifResult = Cy_SMIF_Memslot_CmdWriteEnable(SMIF_Block, smifMemConfigSecondDev, &SMIF_Context);
				if (smifResult != CY_SMIF_SUCCESS) {
					result = RESULT_ERROR;
					break;
				}
			}

			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			while (Cy_SMIF_BusyCheck(SMIF_Block)) {
			}

			/* Write current portion of data */
			if (remainedSize < segmentSize) {
				segmentSize = remainedSize;
			}

			smifResult = Cy_SMIF_TransmitCommand(
				SMIF_Block, smifMemDeviceConfig->programCmd->command, smifMemDeviceConfig->programCmd->cmdWidth,
				addressInFlash, smifMemDeviceConfig->numOfAddrBytes, smifMemDeviceConfig->programCmd->addrWidth,
				smifMemConfig->slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE, &SMIF_Context);

			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			while (Cy_SMIF_GetTxFifoStatus(SMIF_Block) > 0) {
			}

			/* The page program command */
			smifResult = Cy_SMIF_TransmitData(SMIF_Block, NULL, smifMemDeviceConfig->programSize,
											  smifMemDeviceConfig->programCmd->dataWidth, NULL, &SMIF_Context);
			if (smifResult != CY_SMIF_SUCCESS) {
				result = RESULT_ERROR;
				break;
			}

			/* Transfet the data */
			for (uint32_t i = 0; i < smifMemDeviceConfig->programSize; i++) {
				SMIF_Block->TX_DATA_FIFO_WR1 = buffer[offsetInBuffer + i];
				while (Cy_SMIF_GetTxFifoStatus(SMIF_Block) > SMIF_FIFO_THRESHOLD) {
				}
			}

			do {
				while (Cy_SMIF_BusyCheck(SMIF_Block)) {
				}
				smifResult =
					Cy_SMIF_TransmitCommand(SMIF_Block, smifMemConfig->deviceCfg->readStsRegWipCmd->command,
											CY_SMIF_WIDTH_SINGLE, CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_CMD_WITHOUT_PARAM,
											(cy_en_smif_txfr_width_t)CY_SMIF_CMD_WITHOUT_PARAM,
											smifMemConfig->slaveSelect, CY_SMIF_TX_NOT_LAST_BYTE, &SMIF_Context);

				/* Enter the receiving mode */
				SMIF_Block->TX_CMD_FIFO_WR =
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_MODE, CY_SMIF_CMD_FIFO_RX_COUNT_MODE) |
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_WIDTH, (uint32_t)CY_SMIF_WIDTH_SINGLE) |
					_VAL2FLD(CY_SMIF_CMD_FIFO_WR_RX_COUNT, ((uint32_t)(CY_SMIF_READ_ONE_BYTE - 1U)));

				while (SMIF_Block->RX_DATA_FIFO_STATUS == 0) {
				}
				status = SMIF_Block->RX_DATA_FIFO_RD1;
				Cy_SysLib_DelayUs(SMIF_POLLING_DELAY);
			} while ((status & smifMemConfig->deviceCfg->stsRegBusyMask) != 0);

