pdp7/openocd/contrib/loaders/flash/flm/cypress/psoc6/CY8C6xxx_SMIF/cy_loader/cy_loader_smif.c
#ifdef DEBUG_LOG
			LOG("   | programm API call: [blockAddr=0x%08X, &SMIF_Context=0x%08X, smifResult=0x%08X/0x%08X]\r\n",
				(unsigned int)blockAddr, (unsigned int)&SMIF_Context, (unsigned int)smifResult,
				(unsigned int)CY_SMIF_BAD_PARAM);
#endif

			remainedSize -= segmentSize;
			offsetInBuffer += segmentSize;
			currentAddr += segmentSize;
		}
	}
#ifdef DEBUG_LOG
	LOG_FUNC_END(logFuncName, result);
#endif

	return result;
}

/*******************************************************************************
 * Function Name: Loader_SMIF_Verify
 ********************************************************************************
 *
 * Compares data in memory with data in buffer
 * Please note that XIP mode is used for verification.
 *
 * \param blockAddr
 * Start of memory block (absolute 32-bit address) to be verified
 *
 * \param blockSize
 * Size of data to be verified
 *
 * \param buffer
 * Data to be compared for verification
 *
 * \param lastVerifiedAddr
 * Address of last successfully verified data
 * The sum of (addr+size): Data verified successfully
 *
 * \return
 * Status
 * - RESULT_OK: Verified successfully
 * - RESULT_ERROR: Verification failed
 *
 *******************************************************************************/
result_t Loader_SMIF_Verify(uint32_t blockAddr, uint32_t blockSize, uint8_t *buffer, uint32_t *lastVerifiedAddr) {
#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Verify";
	LOG_FUNC_START(logFuncName);
	LOG(" | blockAddr              : 0x%08X\r\n", (unsigned int)blockAddr);
	LOG(" | blockSize              : 0x%08X\r\n", (unsigned int)blockSize);
	LOG(" | buffer                 : 0x%08X\r\n", (unsigned int)buffer);
#endif

	uint32_t i;
	result_t result = RESULT_OK;

	/* Initialize SMIF block if not initialized yet */
	result = Loader_SMIF_Init(SMIF_Config_MEMORY, false);

	if (result == RESULT_OK) { /* Read directly from XIP address space */
		unsigned char *chipData = (unsigned char *)blockAddr;

		/* Compare bytes */
		for (i = 0; i < blockSize; i++) {
			if (buffer[i] != chipData[i]) {
				result = RESULT_ERROR;
				break;
			}
		}

		/* success = (adr+size), otherwise = fail */
		*lastVerifiedAddr = blockAddr + i;
	}

#ifdef DEBUG_LOG
	LOG(" | lastVerifiedAddr       : 0x%08X\r\n", (unsigned int)*lastVerifiedAddr);
	LOG_FUNC_END(logFuncName, result);
#endif

	return result;
}

/*******************************************************************************
 * Function Name: Loader_Flash_IsMemoryFilled
 ********************************************************************************
 *
 * Compares data in memory with given value
 * Please note that XIP mode is used for verification.
 *
 * \param blockAddr
 * Start of memory block (absolute 32-bit address) to be verified
 *
 * \param blockSize
 * Size of data to be compared
 *
 * \param value
 * Value to be compared with memory
 *
 * \return
 * Status
 * - RESULT_OK: Memory is filled with given value
 * - RESULT_ERROR: Memory is not filed with given value
 *
 *******************************************************************************/
result_t Loader_SMIF_IsMemoryFilled(uint32_t blockAddr, uint32_t blockSize, uint8_t value) {
	uint32_t i;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_IsMemoryFilled";
	LOG_FUNC_START(logFuncName);
	LOG(" | blockAddr              : 0x%08X\r\n", (unsigned int)blockAddr);
	LOG(" | blockSize              : 0x%08X\r\n", (unsigned int)blockSize);
	LOG(" | value                  : 0x%08X\r\n", (unsigned int)value);
#endif

	/* Initialize SMIF block if not initialized yet */
	result_t result = Loader_SMIF_Init(SMIF_Config_MEMORY, false);

	if (result == RESULT_OK) { /* Read directly from memory */
		unsigned char *chipData = (unsigned char *)blockAddr;

		/* Compare bytes vith given value*/
		for (i = 0; i < blockSize; i++) {
			if (chipData[i] != value) {
				result = RESULT_ERROR;
				break;
			}
		}
	}

#ifdef DEBUG_LOG
	LOG_FUNC_END(logFuncName, result);
#endif

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_Init_XIP
 ********************************************************************************
 *
 * Initializes SMIF in XIP mode.
 *
 * \param blockAddr
 * Start of memory block (absolute 32-bit address) to be verified
 *
 * \return
 * Status
 * - RESULT_OK: SMIF is ready for read requests
 * - RESULT_ERROR: Error during initialization
 *
 *******************************************************************************/
result_t Loader_SMIF_Init_XIP(uint32_t blockAddr) {
	result_t result = RESULT_OK;
	uint32_t xipAddr = blockAddr;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Init_XIP";
	LOG_FUNC_START(logFuncName);
#endif

	cy_stc_smif_mem_config_t *smifMemConfig = NULL;
	cy_stc_smif_mem_device_cfg_t *smifMemDeviceConfig = NULL;
	result = Loader_SMIF_FindMemDeviceByAddr(xipAddr, &smifMemConfig, &smifMemDeviceConfig);

	if (result == RESULT_OK) {
		result = Loader_SMIF_Init(SMIF_Config_MEMORY, true);
	}

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_Deinit
 ********************************************************************************
 *
 * Deinitialises SMIF
 *
 * \return
 * Status
 * - RESULT_OK: SMIF deinitialised
 * - RESULT_ERROR: SMIF is not initialised
 *
 *******************************************************************************/
result_t Loader_SMIF_Deinit(void) {
	result_t result = RESULT_ERROR;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_Deinit";
	LOG_FUNC_START(logFuncName);
#endif

	if (InitializedSMIFConfig != NULL) {
		Cy_SMIF_DeInit(SMIF_Block);
	}

#ifdef DEBUG_LOG
	LOG_FUNC_END(logFuncName, result);
#endif

	return (result);
}

/*******************************************************************************
 * Function Name: Loader_SMIF_FindSecondDevice
 ********************************************************************************
 *
 * Searches for a second device for dual quad.
 *
 * \param smifMemConfig
 * Pointer to be set
 *
 * \param dualChMask
 * Mask to compare
 *
 * \return
 * Status
 * - RESULT_OK: SMIF deinitialised
 * - RESULT_ERROR: SMIF is not initialised
 *
 *******************************************************************************/
result_t Loader_SMIF_FindSecondDevice(cy_stc_smif_mem_config_t **smifMemConfig, uint32_t dualChMask) {
	cy_stc_smif_mem_config_t *smifMemConfigTest;
	uint32_t result;
	bool foundMemDevice = false;
	bool foundSecondDevice = false;

#ifdef DEBUG_LOG
	const char *logFuncName = "Loader_SMIF_FindSecondDevice";
	LOG_FUNC_START(logFuncName);
	LOG(" | addr                   : 0x%02X\r\n", (unsigned int)addr);
#endif

	/* Load SMIF configuration structures if not yet loaded*/
	result = Loader_SMIF_LoadStructFromFlash(false);

	if (result != RESULT_OK) {
#ifdef DEBUG_LOG
		LOG_FUNC_END(logFuncName, result);
#endif

		result = RESULT_ERROR;
	}

	if (result != RESULT_ERROR) {
		/* Find SMIF memory configuration structure by XIP address */
		uint16_t memCount = SMIF_MAX_SLOT_NUMBER;
		for (int memIdx = 0; memIdx < memCount; memIdx++) {
			if (SMIF_Block_Config->memConfig[memIdx] != NULL) {
				smifMemConfigTest = SMIF_Block_Config->memConfig[memIdx];

				if ((((*smifMemConfig)->flags) & CY_SMIF_FLAG_MEMORY_MAPPED) != 0) {
					if ((dualChMask == (*smifMemConfig)->dualQuadSlots) && (foundMemDevice == true)) {
						*smifMemConfig = smifMemConfigTest;
						foundSecondDevice = true;
						break;
					}

					if (dualChMask == (*smifMemConfig)->dualQuadSlots) {
						foundMemDevice = true;
					}
				}
			}
		}
	}

	result = foundSecondDevice ? RESULT_OK : RESULT_ERROR;

	LOG_FUNC_END(logFuncName, result);

	return (result);
}

#endif /* BUILD_ENABLE_LOADER_SMIF */

/* [] END OF FILE */
